{
    "translation": {
    
    },
    "profile": {
        "sections": "Sessões",
        "aboutmesections": "Sobre mim",
        "contactsections": "Contato",
        "developer": "Desenvolvedor Front-end",
        "skillssections": "Habilidades",
        "projectssections": "Projetos",
        "certificatessections": "Certificados"
    },
    "home": {
        "TitleHome": "Desenvolvedor Front-end",
        "Home1": "Jovem desenvolvedor especializado na construção de experiências digitais excepcionais. Com proficiência nos frameworks mais utilizados pra Web, tenho foco em transformar ideias em realidade, criando interfaces intuitivas e atraentes.",
        "Home2A": "Navegue pelo meu portfólio para descobrir os",
        "Home2Aprojects": "projetos",
        "Home2B": "que tenho orgulho de ter contribuído. Estou comprometido em demonstrar como minha paixão pelo desenvolvimento Front-end se traduz em resultados concretos. E caso queira ter esse Desenvolvedor Front-end na sua equipe ou realizar um trabalho Freelancer, basta entrar em",
        "Home2Bcontact": "contato",
        "Home2C": "e vamos ao trabalho.",
        "HomeOpenToWork": "Disponível pra trabalhos.",
        "SeeMore": "Veja mais sobre mim"
    },
    "about": {
        "AboutTitle": "Sobre o Henrique",
        "AboutLastAtt": "última atualização: 31/08/2023",
        "About1": "Meu nome é Henrique Pinheiro, tenho 21 anos e sou Desenvolvedor de Software Front-end, residente no Rio de Janeiro.",
        "About2": "Na minha adolescência, enquanto passava horas diante do computador, comecei minha jornada criando thumbnails (a capa dos vídeos do youtube, miniaturas) para criadores de conteúdo de Minecraft. Mostrando dedicação sempre que algo me interessava, aprendi rapidamente a mexer no Cinema 4D (programa de computador comercial multiplataforma para modelagem 3D, texturarização, iluminação, animação e renderização 3D). Apreciador do design, sempre encontrei prazer em construir aplicações. Por um período, também me aventurei na criação de animações relacionadas ao universo do Minecraft. No entanto, à medida que fui parando de jogar, acabei me distânciando. Naquela época, lembro-me de ter solicitado à minha mãe que criasse uma conta no PayPal, ela acabou não dando tanto ideia e tive uma ideia bem peculiar: passei a pedir jogos como forma de pagamento. O resultado? Hoje, muitos dos jogos que possuo na Steam foram obtidos por meio de trocas por trabalhos de criação de thumbnails.",
        "About3": "À medida que o tempo avançava, minhas prioridades começaram a mudar, direcionei minha energia para meus estudos no ensino médio e a preparação para o vestibular. No período do ensino médio, me questionei sobre meu futuro profissional. Considerando alternativas como Engenharia Química, Estatística e Matemática, foi ao explorar a vastidão da web que encontrei a resposta. A decisão de me tornar um Desenvolvedor Front-end, construindo websites e imergindo no mundo da tecnologia, me atraiu de forma irresistível. Minha afinidade com o design e a capacidade de criar soluções digitais atraentes e funcionais se alinharam com essa escolha.",
        "About4A": "Minha jornada se intensificou ao ingressar na faculdade de Análise e Desenvolvimento de Sistemas, bem como ao assinar o curso da Alura. Em apenas 30 dias, meu primeiro", 
        "About4Aproject": "projeto",
        "About4B": "ganhou grande reconhecimento no LinkedIn, fortalecendo minha determinação. Desde então, tenho criado projetos com foco na qualidade e na contínua busca por aperfeiçoamento, ciente de que a aprendizagem constante é a chave para o sucesso.",
        "About5": "A área de tecnologia, e especialmente o Desenvolvimento de Software, exige dedicação à constante atualização. Estou consciente de que a indústria evolui rapidamente, e estou comprometido em estar sempre à frente dessas mudanças. Como profissional, investir tempo em estudo e experimentação é essencial para me manter relevante e competitivo. Acredito que o aprendizado é uma jornada contínua, e estou ansioso para abraçar novos desafios e oportunidades.",
        "About6": "Minha personalidade é caracterizada pela perseverança, resiliência e preparação. Encaro cada obstáculo como uma chance de crescimento, e minha busca pela excelência impulsiona minhas ações diárias. Estou comprometido em contribuir de forma significativa em qualquer equipe e projeto em que eu me envolva.",
        "About7": "Curiosidades sobre mim: gosto de correr, ler livros sobre Economia e Investimentos, meu hobbie preferido é jantar fora e conhecer culinária diferente com a companhia da mulher da minha vida, viajar e assistir futebol."
    },
    "contact": {
        "ContactName": "Nome: ",
        "ContactPlaceName": "Digite seu nome: ",
        "ContactPlaceEmail": "Digite seu e-mail: ",
        "ContactMessage": "Mensagem: ",
        "ContactPlaceMessage": "Digite seu e-mail: ",
        "Submit": "Enviar"
    },
    "skill": {
        "SkillName": "Habilidades",
        "ReactDescription": "Biblioteca de interfaces interativas.",
        "JavaScriptDescription": "Linguagem para desenvolvimento web.",
        "StyledCompoDescription": "Estilização de componentes.",
        "SassDescription": "Pré-processador de estilos.",
        "TailwindDescription": "Framework CSS utilitário.",
        "BootstrapDescription": "Framework CSS responsivo.",
	    "CSSDescription": "Estilização de páginas.",
        "HTMLDescription": "Marcação de páginas web.",
	    "TypeScriptDescription": "Superset do JavaScript.",
        "NodeDescription": "Ambiente de Servidor JavaScript.",
	    "SQLDescription": "Gerenciamento de Dados Relacionais.",
        "AngularDescription": "Framework escalável.",
	    "SkillLearning": "Aprendendo",
	    "SkillsTextT": "Planos pro futuro.",
	    "SkillsText1": "Atualmente, meu foco principal é no desenvolvimento front-end. Acredito que a experiência do usuário é fundamental, e estou empenhado em criar interfaces de usuário atraentes e intuitivas que proporcionem uma ótima experiência aos usuários finais.",
	    "SkillsText2": "Além disso, estou sempre em busca de aprendizado contínuo. Estou explorando novas tecnologias, como TypeScript e Angular, para expandir ainda mais meu conjunto de habilidades e abraçar desafios mais amplos no futuro.",
	    "SkillsText3": "Meu objetivo final é me tornar um desenvolvedor Fullstack, mas estou ciente da importância de construir uma base sólida no front-end antes de prosseguir para o back-end. Estou comprometido em me manter atualizado com as últimas tendências e melhores práticas do setor, para que eu possa contribuir de maneira significativa para projetos empolgantes e desafiadores."
    },
    "project": {
        "ProjectName": "Projetos",
	    "ProjectDesc1": "Bem-vindo ao meu portfólio de projetos! Aqui, você encontrará uma coleção de trabalhos que representam minha paixão e dedicação ao mundo da programação. Cada projeto é uma expressão da minha criatividade e habilidades técnicas, cuidadosamente desenvolvidos para oferecer soluções práticas e funcionais.",
	    "ProjectDesc2": "Explore esses projetos abaixo e sinta-se à vontade para entrar em contato caso deseje solicitar um orçamento. Estou animado para trabalhar em novos desafios e transformar suas ideias em realidade.",
	    "ProjectPrice": "Fazer um orçamento",
	    "RealStateDescription": "Website de imobiliária com ênfase na prática de React, apresentando um ecrã básico e mostrando a componentização com Styled-components.",
        "PhotographerTitle": "Portfólio Fotógrafo",
        "PhotographerDescription": "Portfólio de Fotografia e Produção de Vídeo: uma exposição cativante de habilidade artística, destreza e a arte de contar histórias visuais, com um design limpo e dinâmico inspirado por profissionais renomados em todo o mundo.",
        "DSMTitle": "DSM Consultoria",
        "DSMDescription": "[Projeto em progresso]",
        "RXDescription": "Projeto completo de um e-commerce, com tela de login, registo, carrinho de compras, páginas de produtos individuais e etc...",
	    "JapapouDescription": "Projeto de prática de React: Elevar e aperfeiçoar as competências em React através da implementação de Hooks, Módulos CSS e técnicas eficazes de estruturação de conteúdos."
    },
    "footer": {
        "FooterName": "Contato",
        "FooterDesc": "Dê o primeiro passo ao seu empreedimento e tenha um website moderno ou caso queira ter um Desenvolvedor Front-end dedicado na sua equipe:"
},
    "header": {
        "HeaderDesc": "Desenvolvedor Front-end"
    }
}
